package study05.exam;
/*
 *  2중 배열
 *  
 *  1  2  3  4  5  6  7
 *  8  9  10 11 12 13 14
 *  15 16 17 18 19 20 21
 *  22 23 24 25 26 27 28
 *  29 30 31 32 33 34 35
 *  36 37 38 39 40 41 42
 *  43 44 45 46 47 48 49
 *  
 *  1. 2중배열선언하고
 *  2. for문으로 값을 1~49까지 위모양으로 넣으세요
 *  3. 출력은 지그재그
 * 
 *  출력순서는 1 8 2 3 9 15 22 16 10 이런식으로 지그재그형태
 */

public class Exam04 {

	public static void main(String[] args) {
		int[][] arr = { { 1, 2, 3, 4, 5, 6, 7 }, { 8, 9, 10, 11, 12, 13, 14 }, { 15, 16, 17, 18, 19, 20, 21 },
				{ 22, 23, 24, 25, 26, 27, 28 }, { 29, 30, 31, 32, 33, 34, 35 }, { 36, 37, 38, 39, 40, 41, 42 },
				{ 43, 44, 45, 46, 47, 48, 49 } };

		int text = 1;
		int zig = 1;

		for (int i = 0; i < text; i++) {
			for (int j = 0; j < zig; j++) {
				System.out.print(arr[i][j] + " ");
			}
			if (i % 2 == 0) {
				text++;
			} else if (i % 2 != 0) {
				zig++;
			} else {

			}
			System.out.println();
		}

	}

}